#include <iostream>
// Удаляем строку: using namespace std;

int main() {
<<<<<<< HEAD
    std::string name; // Переменная для хранения имени пользователя
=======
    std::string name; // Привет мир
>>>>>>> 001ada2296952c3be859e65f379c1ceedf18702c

    // Запрашиваем имя пользователя
    std::cout << "Введите ваше имя: "; // Выводим запрос на ввод имени
    std::cin >> name; // Считываем имя пользователя из ввода

    // Выводим приветственное сообщение с именем пользователя
    std::cout << "Hello world from " << name << std::endl; // Используем endl для перехода на новую строку

    return 0; // Завершаем программу
<<<<<<< HEAD
}
=======
}
>>>>>>> 001ada2296952c3be859e65f379c1ceedf18702c
